In [1]:
import numpy as np
import pandas as pd

In [11]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': [10, 20, 30, 40],
    'C': [100, 200, 300, 400]
})

## Applying funcs across the data

In [12]:
# Math funcs, apply for multiple columns
df['C'].apply(np.sqrt)

0    10.000000
1    14.142136
2    17.320508
3    20.000000
Name: C, dtype: float64

In [13]:
def multiply_by_three(n):
    return n * 3

In [14]:
df['A'].apply(multiply_by_three)

0     3
1     6
2     9
3    12
Name: A, dtype: int64

In [15]:
df[['A', 'B']].apply(multiply_by_three)

    A    B
0   3   30
1   6   60
2   9   90
3  12  120

In [16]:
# map
mapping = {1:'ONE' , 2:'TWO' , 3:'THREE' ,4:'FOUR' }
df["A"].map(mapping)

0      ONE
1      TWO
2    THREE
3     FOUR
Name: A, dtype: object

In [17]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400

In [18]:
df.applymap(multiply_by_three) #applies function on every value

    A    B     C
0   3   30   300
1   6   60   600
2   9   90   900
3  12  120  1200

In [ ]:
# map - changes one value to another 1 - ONE
# apply - applies a function to a value -1 * 3
# applymap - applies a fucntion on all of the dataframe

### Group by

In [19]:
df = pd.DataFrame({
    'Animal': ['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    'Max Speed': [380., 370., 24., 26.],
    'Weight': [1, 1.5, 0.3, 0.5]
})

In [21]:
df.groupby('Animal').mean()

        Max Speed  Weight
Animal
Falcon      375.0    1.25
Parrot       25.0    0.40